results/threshold-fail.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: threshold-fail.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 25 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 50 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m05.0s), 30/30 VUs, 55 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m05.0s/1m0s

running (0m06.0s), 30/30 VUs, 85 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m07.0s), 30/30 VUs, 110 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m08.0s), 30/30 VUs, 140 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m09.0s), 30/30 VUs, 145 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m10.0s), 30/30 VUs, 175 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m11.0s), 30/30 VUs, 200 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m11.0s/1m0s

running (0m12.0s), 30/30 VUs, 230 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m13.0s), 30/30 VUs, 235 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m14.0s), 30/30 VUs, 265 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m15.0s), 30/30 VUs, 290 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m16.0s), 30/30 VUs, 320 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m17.0s), 30/30 VUs, 350 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m18.0s), 30/30 VUs, 355 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m19.0s), 30/30 VUs, 380 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m20.0s), 30/30 VUs, 410 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m20.0s/1m0s

running (0m21.0s), 30/30 VUs, 440 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m22.0s), 30/30 VUs, 445 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m23.0s), 30/30 VUs, 470 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m24.0s), 30/30 VUs, 500 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m25.0s), 30/30 VUs, 530 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m26.0s), 30/30 VUs, 535 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m27.0s), 30/30 VUs, 560 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m28.0s), 30/30 VUs, 590 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m29.0s), 30/30 VUs, 620 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m30.0s), 30/30 VUs, 625 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m31.0s), 30/30 VUs, 650 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m32.0s), 30/30 VUs, 680 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m33.0s), 30/30 VUs, 710 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m34.0s), 30/30 VUs, 715 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m35.0s), 30/30 VUs, 740 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m36.0s), 30/30 VUs, 770 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m37.0s), 30/30 VUs, 800 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m38.0s), 30/30 VUs, 805 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m39.0s), 30/30 VUs, 830 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m40.0s), 30/30 VUs, 860 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m41.0s), 30/30 VUs, 890 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m42.0s), 30/30 VUs, 895 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m43.0s), 30/30 VUs, 920 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m44.0s), 30/30 VUs, 950 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m45.0s), 30/30 VUs, 980 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m46.0s), 30/30 VUs, 985 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m47.0s), 30/30 VUs, 1010 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m48.0s), 30/30 VUs, 1040 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m49.0s), 30/30 VUs, 1070 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m50.0s), 30/30 VUs, 1100 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m51.0s), 30/30 VUs, 1105 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m52.0s), 30/30 VUs, 1130 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m53.0s), 30/30 VUs, 1160 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  0m53.0s/1m0s

running (0m54.0s), 30/30 VUs, 1165 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  0m54.0s/1m0s

running (0m55.0s), 30/30 VUs, 1190 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  0m55.0s/1m0s

running (0m56.0s), 30/30 VUs, 1220 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  0m56.0s/1m0s

running (0m57.0s), 30/30 VUs, 1250 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  0m57.0s/1m0s

running (0m58.0s), 30/30 VUs, 1280 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  0m58.0s/1m0s

running (0m59.0s), 30/30 VUs, 1285 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m00.0s), 30/30 VUs, 1310 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<50' p(95)=279.94ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1340    22.132201/s
    checks_succeeded...: 100.00% 1340 out of 1340
    checks_failed......: 0.00%   0 out of 1340

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=160.55ms min=53.39ms med=176.25ms max=531.54ms p(90)=276.37ms p(95)=279.94ms
      { expected_response:true }...: avg=160.55ms min=53.39ms med=176.25ms max=531.54ms p(90)=276.37ms p(95)=279.94ms
    http_req_failed................: 0.00%  0 out of 2680
    http_reqs......................: 2680   44.264402/s

    EXECUTION
    iteration_duration.............: avg=1.35s    min=1.26s   med=1.33s    max=4.52s    p(90)=1.34s    p(95)=1.37s   
    iterations.....................: 1340   22.132201/s
    vus............................: 30     min=30        max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 5.1 MB 85 kB/s
    data_sent......................: 225 kB 3.7 kB/s



running (1m00.5s), 00/30 VUs, 1340 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  1m0s